In [1]:
import pandas as pd

In [2]:
dict1 = {"name" :["ineuron" , "sudh" , "krish" , "kumar"],
         "number":[3,4,6,9],
         "test":["xyz" ,"ABC" ,"dyu" , "ert"],
         "string" :["dfdsfs" ,"dsfsf" ,"trert" ,"rwewer"]
    }

In [3]:
df1 = pd.DataFrame(dict1)

In [4]:
df1

      name  number test  string
0  ineuron       3  xyz  dfdsfs
1     sudh       4  ABC   dsfsf
2    krish       6  dyu   trert
3    kumar       9  ert  rwewer

In [5]:
dict2 = {"name1" :["ineuron1" , "sudh1" , "krish" , "kumar"],
         "number1":[31,41,61,91],
         "test1":["xyz1" ,"ABC1" ,"dyu1" , "ert1"],
         "string1" :["dfdsfs" ,"dsfsf" ,"trert1" ,"rwewer"]
    }

In [6]:
df2 = pd.DataFrame(dict2)

In [7]:
df2

      name1  number1 test1 string1
0  ineuron1       31  xyz1  dfdsfs
1     sudh1       41  ABC1   dsfsf
2     krish       61  dyu1  trert1
3     kumar       91  ert1  rwewer

In [8]:
df3 = pd.concat([df1,df2]) #here by default axis=0

In [9]:
df3

      name  number test  string     name1  number1 test1 string1
0  ineuron     3.0  xyz  dfdsfs       NaN      NaN   NaN     NaN
1     sudh     4.0  ABC   dsfsf       NaN      NaN   NaN     NaN
2    krish     6.0  dyu   trert       NaN      NaN   NaN     NaN
3    kumar     9.0  ert  rwewer       NaN      NaN   NaN     NaN
0      NaN     NaN  NaN     NaN  ineuron1     31.0  xyz1  dfdsfs
1      NaN     NaN  NaN     NaN     sudh1     41.0  ABC1   dsfsf
2      NaN     NaN  NaN     NaN     krish     61.0  dyu1  trert1
3      NaN     NaN  NaN     NaN     kumar     91.0  ert1  rwewer

In [10]:
df4 = pd.concat([df1,df2] ,axis= 1)

In [11]:
df4

      name  number test  string     name1  number1 test1 string1
0  ineuron       3  xyz  dfdsfs  ineuron1       31  xyz1  dfdsfs
1     sudh       4  ABC   dsfsf     sudh1       41  ABC1   dsfsf
2    krish       6  dyu   trert     krish       61  dyu1  trert1
3    kumar       9  ert  rwewer     kumar       91  ert1  rwewer

In [16]:
df4.iloc[1:3,1:3] #df.iloc[row slicing, columns slicing]

   number test
1       4  ABC
2       6  dyu

In [17]:
df4.iloc[1:3][['number','test']] #bringing out number and test columns from row 1 to 2

   number test
1       4  ABC
2       6  dyu

In [18]:
df4.iloc[[1,3],5:] #df4.iloc[rows,columns]

   number1 test1 string1
1       41  ABC1   dsfsf
3       91  ert1  rwewer

In [19]:
df5 = df4.iloc[1,3] #df4.iloc[row,column] and df.iloc[start:end:jump] and df.iloc[[row1,row2,row3],[columns1,columns2,columns3]]

In [20]:
df5  #output will be in 1st row and 3rd columns

'dsfsf'

In [21]:
df5=df4.iloc[[1,3]]

In [22]:
df5

    name  number test  string  name1  number1 test1 string1
1   sudh       4  ABC   dsfsf  sudh1       41  ABC1   dsfsf
3  kumar       9  ert  rwewer  kumar       91  ert1  rwewer

In [23]:
df5[['number1','test1','string1']]

   number1 test1 string1
1       41  ABC1   dsfsf
3       91  ert1  rwewer

In [26]:
df4.iloc[[1,3]][['number1','test1','string1']]

   number1 test1 string1
1       41  ABC1   dsfsf
3       91  ert1  rwewer

In [27]:
df4.columns

Index(['name', 'number', 'test', 'string', 'name1', 'number1', 'test1',
       'string1'],
      dtype='object')

In [28]:
dict1 = {"name" :["ineuron" , "sudh" , "krish" , "kumar"],
         "number":[3,4,6,9],
         "test":["xyz" ,"ABC" ,"dyu" , "ert"],
         "string" :["dfdsfs" ,"dsfsf" ,"trert" ,"rwewer"]
    }

In [29]:
dict2 = {"name" :["ineuron1" , "sudh1" , "krish" , "kumar"],
         "number":[31,41,61,91],
         "test":["xyz1" ,"ABC1" ,"dyu1" , "ert1"],
         "string" :["dfdsfs" ,"dsfsf" ,"trert1" ,"rwewer"]
    }

In [30]:
df1 = pd.DataFrame(dict1)

In [31]:
df2 = pd.DataFrame(dict2)

In [32]:
df1

      name  number test  string
0  ineuron       3  xyz  dfdsfs
1     sudh       4  ABC   dsfsf
2    krish       6  dyu   trert
3    kumar       9  ert  rwewer

In [28]:
df2

       name  number  test  string
0  ineuron1      31  xyz1  dfdsfs
1     sudh1      41  ABC1   dsfsf
2     krish      61  dyu1  trert1
3     kumar      91  ert1  rwewer

In [29]:
pd.merge(df1,df2, on='string') #by default how is inner here

    name_x  number_x test_x  string    name_y  number_y test_y
0  ineuron         3    xyz  dfdsfs  ineuron1        31   xyz1
1     sudh         4    ABC   dsfsf     sudh1        41   ABC1
2    kumar         9    ert  rwewer     kumar        91   ert1

In [30]:
pd.merge(df1 , df2 , on = 'string', how = 'right')

    name_x  number_x test_x  string    name_y  number_y test_y
0  ineuron       3.0    xyz  dfdsfs  ineuron1        31   xyz1
1     sudh       4.0    ABC   dsfsf     sudh1        41   ABC1
2      NaN       NaN    NaN  trert1     krish        61   dyu1
3    kumar       9.0    ert  rwewer     kumar        91   ert1

In [31]:
pd.merge(df1 , df2 , on = 'string', how='left')

    name_x  number_x test_x  string    name_y  number_y test_y
0  ineuron         3    xyz  dfdsfs  ineuron1      31.0   xyz1
1     sudh         4    ABC   dsfsf     sudh1      41.0   ABC1
2    krish         6    dyu   trert       NaN       NaN    NaN
3    kumar         9    ert  rwewer     kumar      91.0   ert1

In [32]:
pd.merge(df1 , df2 , on = 'string', how='outer')

    name_x  number_x test_x  string    name_y  number_y test_y
0  ineuron       3.0    xyz  dfdsfs  ineuron1      31.0   xyz1
1     sudh       4.0    ABC   dsfsf     sudh1      41.0   ABC1
2    krish       6.0    dyu   trert       NaN       NaN    NaN
3    kumar       9.0    ert  rwewer     kumar      91.0   ert1
4      NaN       NaN    NaN  trert1     krish      61.0   dyu1

In [8]:
dict1 = {"name" :["ineuron" , "sudh" , "krish" , "kumar"],
         "number":[3,4,6,9],
         "test":["xyz" ,"ABC" ,"dyu" , "ert"],
         "string" :["dfdsfs" ,"dsfsf" ,"trert" ,"rwewer"]
    }

In [9]:
dict2 = {"name" :["ineuron1" , "sudh1" , "krish" , "kumar"],
         "number":[31,41,61,91],
         "test":["xyz1" ,"ABC1" ,"dyu1" , "ert1"],
         "string1" :["dfdsfs" ,"dsfsf" ,"trert1" ,"rwewer"]
    }

In [10]:
df1=pd.DataFrame(dict1)

In [11]:
df2=pd.DataFrame(dict2)

In [12]:
df1

      name  number test  string
0  ineuron       3  xyz  dfdsfs
1     sudh       4  ABC   dsfsf
2    krish       6  dyu   trert
3    kumar       9  ert  rwewer

In [13]:
df2

       name  number  test string1
0  ineuron1      31  xyz1  dfdsfs
1     sudh1      41  ABC1   dsfsf
2     krish      61  dyu1  trert1
3     kumar      91  ert1  rwewer

In [14]:
pd.merge(df1 , df2 , left_on = 'string',right_on='string1', how = 'left')

    name_x  number_x test_x  string    name_y  number_y test_y string1
0  ineuron         3    xyz  dfdsfs  ineuron1      31.0   xyz1  dfdsfs
1     sudh         4    ABC   dsfsf     sudh1      41.0   ABC1   dsfsf
2    krish         6    dyu   trert       NaN       NaN    NaN     NaN
3    kumar         9    ert  rwewer     kumar      91.0   ert1  rwewer

In [15]:
pd.merge(df1 , df2 , left_on = 'string',right_on='string1', how = 'outer')

    name_x  number_x test_x  string    name_y  number_y test_y string1
0  ineuron       3.0    xyz  dfdsfs  ineuron1      31.0   xyz1  dfdsfs
1     sudh       4.0    ABC   dsfsf     sudh1      41.0   ABC1   dsfsf
2    krish       6.0    dyu   trert       NaN       NaN    NaN     NaN
3    kumar       9.0    ert  rwewer     kumar      91.0   ert1  rwewer
4      NaN       NaN    NaN     NaN     krish      61.0   dyu1  trert1

In [16]:
df1

      name  number test  string
0  ineuron       3  xyz  dfdsfs
1     sudh       4  ABC   dsfsf
2    krish       6  dyu   trert
3    kumar       9  ert  rwewer

In [17]:
df2

       name  number  test string1
0  ineuron1      31  xyz1  dfdsfs
1     sudh1      41  ABC1   dsfsf
2     krish      61  dyu1  trert1
3     kumar      91  ert1  rwewer

In [18]:
pd.merge(df1,df2,how='left' , on = ['name' ,'number'])

      name  number test_x  string test_y string1
0  ineuron       3    xyz  dfdsfs    NaN     NaN
1     sudh       4    ABC   dsfsf    NaN     NaN
2    krish       6    dyu   trert    NaN     NaN
3    kumar       9    ert  rwewer    NaN     NaN

In [19]:
df1

      name  number test  string
0  ineuron       3  xyz  dfdsfs
1     sudh       4  ABC   dsfsf
2    krish       6  dyu   trert
3    kumar       9  ert  rwewer

In [20]:
df2

       name  number  test string1
0  ineuron1      31  xyz1  dfdsfs
1     sudh1      41  ABC1   dsfsf
2     krish      61  dyu1  trert1
3     kumar      91  ert1  rwewer

In [21]:
df1.join(df2 , on = 'name')

ValueError: You are trying to merge on object and int64 columns. If you wish to proceed you should use pd.concat

In [22]:
dict2 = {"name1" :["ineuron1" , "sudh1" , "krish" , "kumar"],
         "number1":[31,41,61,91],
         "test1":["xyz1" ,"ABC1" ,"dyu1" , "ert1"],
         "string1" :["dfdsfs" ,"dsfsf" ,"trert1" ,"rwewer"]
    }

In [23]:
df3 = pd.DataFrame(dict2)

In [24]:
df1.join(df3) #in both data frame you need to keep different columns name to operate join operation

      name  number test  string     name1  number1 test1 string1
0  ineuron       3  xyz  dfdsfs  ineuron1       31  xyz1  dfdsfs
1     sudh       4  ABC   dsfsf     sudh1       41  ABC1   dsfsf
2    krish       6  dyu   trert     krish       61  dyu1  trert1
3    kumar       9  ert  rwewer     kumar       91  ert1  rwewer

In [25]:
df1.join(df3,how = 'outer')

      name  number test  string     name1  number1 test1 string1
0  ineuron       3  xyz  dfdsfs  ineuron1       31  xyz1  dfdsfs
1     sudh       4  ABC   dsfsf     sudh1       41  ABC1   dsfsf
2    krish       6  dyu   trert     krish       61  dyu1  trert1
3    kumar       9  ert  rwewer     kumar       91  ert1  rwewer

In [26]:
df1.join(df3,how = 'left')

      name  number test  string     name1  number1 test1 string1
0  ineuron       3  xyz  dfdsfs  ineuron1       31  xyz1  dfdsfs
1     sudh       4  ABC   dsfsf     sudh1       41  ABC1   dsfsf
2    krish       6  dyu   trert     krish       61  dyu1  trert1
3    kumar       9  ert  rwewer     kumar       91  ert1  rwewer

In [27]:
df1.join(df3,how = 'right')

      name  number test  string     name1  number1 test1 string1
0  ineuron       3  xyz  dfdsfs  ineuron1       31  xyz1  dfdsfs
1     sudh       4  ABC   dsfsf     sudh1       41  ABC1   dsfsf
2    krish       6  dyu   trert     krish       61  dyu1  trert1
3    kumar       9  ert  rwewer     kumar       91  ert1  rwewer

In [28]:
dict2 = {"name1" :["ineuron1" , "sudh1" , "krish" , "kumar"],
         "number1":[31,41,61,91],
         "test1":["xyz1" ,"ABC1" ,"dyu1" , "ert1"],
         "string1" :["dfdsfs" ,"dsfsf" ,"trert1" ,"rwewer"]
    }

In [29]:
df5 = pd.DataFrame(dict2 , index = [1,0,6,7])

In [30]:
df1

      name  number test  string
0  ineuron       3  xyz  dfdsfs
1     sudh       4  ABC   dsfsf
2    krish       6  dyu   trert
3    kumar       9  ert  rwewer

In [31]:
df5

      name1  number1 test1 string1
1  ineuron1       31  xyz1  dfdsfs
0     sudh1       41  ABC1   dsfsf
6     krish       61  dyu1  trert1
7     kumar       91  ert1  rwewer

In [32]:
df1.join(df5)  #in join operation it tries to join matching of the indexes and by default how is left here

      name  number test  string     name1  number1 test1 string1
0  ineuron       3  xyz  dfdsfs     sudh1     41.0  ABC1   dsfsf
1     sudh       4  ABC   dsfsf  ineuron1     31.0  xyz1  dfdsfs
2    krish       6  dyu   trert       NaN      NaN   NaN     NaN
3    kumar       9  ert  rwewer       NaN      NaN   NaN     NaN

In [33]:
df1.join(df5 , how = 'right')

      name  number test  string     name1  number1 test1 string1
1     sudh     4.0  ABC   dsfsf  ineuron1       31  xyz1  dfdsfs
0  ineuron     3.0  xyz  dfdsfs     sudh1       41  ABC1   dsfsf
6      NaN     NaN  NaN     NaN     krish       61  dyu1  trert1
7      NaN     NaN  NaN     NaN     kumar       91  ert1  rwewer

In [34]:
df1.join(df5 , how = 'left')

      name  number test  string     name1  number1 test1 string1
0  ineuron       3  xyz  dfdsfs     sudh1     41.0  ABC1   dsfsf
1     sudh       4  ABC   dsfsf  ineuron1     31.0  xyz1  dfdsfs
2    krish       6  dyu   trert       NaN      NaN   NaN     NaN
3    kumar       9  ert  rwewer       NaN      NaN   NaN     NaN

In [35]:
ls

 Volume in drive F is New Volume
 Volume Serial Number is AC80-4F0C

 Directory of F:\ML Tutorial\Utsho\Python_Codes

09/15/2023  10:19 PM    <DIR>          .
09/15/2023  10:19 PM    <DIR>          ..
08/30/2023  07:54 PM    <DIR>          .ipynb_checkpoints
09/15/2023  10:19 PM            96,860 10.pandas and basic function.ipynb
09/06/2023  04:34 AM            43,754 11. Numpy (1).ipynb
08/21/2023  09:43 PM            82,725 2. python basic 1.ipynb
09/01/2023  01:11 AM         1,529,719 4. python list and string inbuilt function.ipynb
09/01/2023  02:02 AM            55,652 5. Tuple , set and dict.ipynb
07/09/2023  10:13 PM            28,737 6. Function in python .ipynb
12/27/2022  07:05 PM            34,678 7. python exception handling.ipynb
09/13/2023  08:40 PM         1,387,834 8. pandas.ipynb
08/23/2023  08:26 PM           292,866 9. pandas data manupulation.ipynb
06/04/2023  08:34 PM               395 imp notes.txt
08/30/2023  07:52 PM            16,155 practice.ipynb
04/09/2023  09:17 PM               455 pyvenv.cfg
08/15/2023  07:25 PM            81,549 test1.csv
09/06/2023  11:52 PM    <DIR>          visulization
              13 File(s)      3,651,379 bytes
               4 Dir(s)  129,548,300,288 bytes free

In [36]:
pwd

'F:\\ML Tutorial\\Utsho\\Python_Codes'

In [22]:
dict1 = {'col1' :[1,2,3,4,5,6,7,8,934],
         'col2' :[354,45,54,545,545,545,545,545,234],
         'col3' :"my name is sudhanshu kumar ineuron initelligence private limited".split()
    
}

In [23]:
df = pd.DataFrame(dict1)

In [24]:
"my name is sudhanshu kumar".split()

['my', 'name', 'is', 'sudhanshu', 'kumar']

In [25]:
df

   col1  col2           col3
0     1   354             my
1     2    45           name
2     3    54             is
3     4   545      sudhanshu
4     5   545          kumar
5     6   545        ineuron
6     7   545  initelligence
7     8   545        private
8   934   234        limited

In [26]:
dict1 = {'col1' :[1,2,3,4,5,6,7,8,934],
         'col2' :[354,45,54,545,545,545,545,545,234],
         'col3' :"my name is sudhanshu kumar ineuron limited".split()
    
}

In [27]:
df6=pd.DataFrame(dict1)

ValueError: All arrays must be of the same length

In [ ]:
dict1 = {'col1' :[1,2,3,4,5,6,7,8,934],
         'col2' :[354,45,54,545,545,545,545,545,234],
         'col3' :"my name is sudhanshu kumar ineuron limited kkk llll".split()
    
}

In [28]:
df6=pd.DataFrame(dict1)
df6

ValueError: All arrays must be of the same length

In [29]:
df['col4'] = 2*df['col2']

In [30]:
df

   col1  col2           col3  col4
0     1   354             my   708
1     2    45           name    90
2     3    54             is   108
3     4   545      sudhanshu  1090
4     5   545          kumar  1090
5     6   545        ineuron  1090
6     7   545  initelligence  1090
7     8   545        private  1090
8   934   234        limited   468

In [31]:
import numpy as np
df['col5'] = np.log(df['col2'])

In [32]:
df

   col1  col2           col3  col4      col5
0     1   354             my   708  5.869297
1     2    45           name    90  3.806662
2     3    54             is   108  3.988984
3     4   545      sudhanshu  1090  6.300786
4     5   545          kumar  1090  6.300786
5     6   545        ineuron  1090  6.300786
6     7   545  initelligence  1090  6.300786
7     8   545        private  1090  6.300786
8   934   234        limited   468  5.455321

In [33]:
def testfun(data):
    if data> 500 :
        return np.log10(data)
    else :
        return data/10

In [34]:
df['col6'] = df['col2'].apply(testfun)

In [35]:
df

   col1  col2           col3  col4      col5       col6
0     1   354             my   708  5.869297  35.400000
1     2    45           name    90  3.806662   4.500000
2     3    54             is   108  3.988984   5.400000
3     4   545      sudhanshu  1090  6.300786   2.736397
4     5   545          kumar  1090  6.300786   2.736397
5     6   545        ineuron  1090  6.300786   2.736397
6     7   545  initelligence  1090  6.300786   2.736397
7     8   545        private  1090  6.300786   2.736397
8   934   234        limited   468  5.455321  23.400000

In [36]:
len("my")

2

In [37]:
df['col7'] = df['col3'].apply(len)

In [38]:
df

   col1  col2           col3  col4      col5       col6  col7
0     1   354             my   708  5.869297  35.400000     2
1     2    45           name    90  3.806662   4.500000     4
2     3    54             is   108  3.988984   5.400000     2
3     4   545      sudhanshu  1090  6.300786   2.736397     9
4     5   545          kumar  1090  6.300786   2.736397     5
5     6   545        ineuron  1090  6.300786   2.736397     7
6     7   545  initelligence  1090  6.300786   2.736397    13
7     8   545        private  1090  6.300786   2.736397     7
8   934   234        limited   468  5.455321  23.400000     7

In [39]:
df.sort_values(by = "col2" ,ascending=False)  #by default ascending is true...if false then it will print in descending order

   col1  col2           col3  col4      col5       col6  col7
3     4   545      sudhanshu  1090  6.300786   2.736397     9
4     5   545          kumar  1090  6.300786   2.736397     5
5     6   545        ineuron  1090  6.300786   2.736397     7
6     7   545  initelligence  1090  6.300786   2.736397    13
7     8   545        private  1090  6.300786   2.736397     7
0     1   354             my   708  5.869297  35.400000     2
8   934   234        limited   468  5.455321  23.400000     7
2     3    54             is   108  3.988984   5.400000     2
1     2    45           name    90  3.806662   4.500000     4

In [40]:
l = [1,2,3,4,5,6]

[i+1 for i in l ]

[2, 3, 4, 5, 6, 7]

In [41]:
def test(data):
    return data +1

In [42]:
list(map(test,l))

[2, 3, 4, 5, 6, 7]

In [43]:
def test1 (data):
    if data<3:
        return np.sqrt(data)
    else:
        return np.log(data)

In [44]:
list(map(test1,l))

[1.0,
 1.4142135623730951,
 1.0986122886681098,
 1.3862943611198906,
 1.6094379124341003,
 1.791759469228055]

In [45]:
l

[1, 2, 3, 4, 5, 6]

In [46]:
l1 = [34,45,23,12,34,34]

In [47]:
list(map(lambda data : data+1 , l))

[2, 3, 4, 5, 6, 7]

In [48]:
list(map(lambda x , y : x+y  , l , l1))

[35, 47, 26, 16, 39, 40]

In [49]:
def test(x ,y):
    return x+y

In [50]:
list(map(test , l,l1))

[35, 47, 26, 16, 39, 40]

In [51]:
l

[1, 2, 3, 4, 5, 6]

In [52]:
list(map(lambda x : np.sqrt(x) if x <3 else np.log(x) , l ))

[1.0,
 1.4142135623730951,
 1.0986122886681098,
 1.3862943611198906,
 1.6094379124341003,
 1.791759469228055]

In [53]:
def test1 (data):
    if data<3:
        return np.sqrt(data)
    else:
        return np.log(data)

In [54]:
import functools

In [55]:
l1 = [4,5,6,7,7,8,8]

In [56]:
sum(l1)

45

In [57]:
functools.reduce( test1, l1)

TypeError: test1() takes 1 positional argument but 2 were given

In [58]:
def test1(x,y):
    return x+y

In [59]:
functools.reduce(lambda x,y : x+y ,l1)

45

In [60]:
functools.reduce(lambda x,y : x if x > y else y, l1)

8

In [61]:
l1

[4, 5, 6, 7, 7, 8, 8]

In [62]:
l = [1,2,3,4,5,6,7,7,8,9,9,0,0,0,45,67]

In [63]:
def test(data):
    if data % 2 ==0:
        return True
    else :
        return False

In [64]:
4%2

0

In [ ]:
g = lambda data : True if data % 2 ==1 else False

In [ ]:
list(filter(test, l))   #filter function will work only for true false output

In [ ]:
list(filter(g , l))